groups_commands = [
    'список',
    'группы',
]

start_commands = [
    'старт',
    'start',
    'help',
    'помощь'
]

GROUPS_PARAMETERS = [
    '?ii=1&fi=1&c=1&',
    '?ii=1&fi=1&c=2&',
    '?ii=1&fi=1&c=3&',
    '?ii=1&fi=1&c=4&',
    '?ii=1&fi=1&c=5&',
    '?ii=1&fi=1&c=6&',
    '?ii=1&fi=4&c=1&',
    '?ii=1&fi=4&c=2&',
    '?ii=1&fi=4&c=3&',
    '?ii=1&fi=4&c=4&',
    '?ii=1&fi=4&c=5&',
    '?ii=1&fi=4&c=6&',
    '?ii=2&fi=1&c=1&',
    '?ii=2&fi=1&c=2&',
    '?ii=2&fi=1&c=3&',
    '?ii=2&fi=1&c=4&',
    '?ii=3&fi=1&c=1&',
    '?ii=3&fi=1&c=2&',
    '?ii=3&fi=1&c=3&',
    '?ii=3&fi=1&c=4&',
    '?ii=3&fi=1&c=5&',
    '?ii=3&fi=1&c=6&',
    '?ii=3&fi=4&c=1&',
    '?ii=3&fi=4&c=2&',
    '?ii=3&fi=4&c=3&',
    '?ii=3&fi=4&c=4&',
    '?ii=3&fi=4&c=5&',
    '?ii=3&fi=4&c=6&',
    '?ii=3&fi=6&c=1&',
    '?ii=3&fi=6&c=2&',
    '?ii=3&fi=6&c=3&',
    '?ii=3&fi=6&c=4&',
    '?ii=3&fi=6&c=5&',
    '?ii=3&fi=6&c=6&'
]

SCHEDULE_URL = 'http://rasp.sgugit.ru/'

SCHEDULE_NUMBERS = ['1️⃣', '2️⃣', '3️⃣', '4️⃣', '5️⃣', '6️⃣', '7️⃣', '8️⃣', '9️⃣', '🔟']

MESSAGE_STOP_FLOOD = '📛 Пожалуйста, прекратите флудить.'
MESSAGE_GROUP_NOT_FOUND = '📛 Группа не найдена. Чтобы посмотреть все доступные группы, напишите "список" или "группы".'
MESSAGE_SCHEDULE_NOT_FOUND = '📛 Расписание не найдено, попробуйте позже.'
MESSAGE_CURRENT_WEEK_NOT_FOUND = '📛 Расписание на текущую неделю не найдено, попробуйте позже.'
MESSAGE_CONNECTION_PROBLEM = '📛 Проблема с соединением сайта, попробуйте позже.'
MESSAGE_ON_START = '👋 Здравствуйте. Напишите название вашей группы и бот пришлёт вам расписание.'

spam_list = {}