groups_commands = [
    'список групп',
    'группы',
    'выбрать группу'
]

start_commands = [
    'старт',
    'start',
    'help',
    'помощь'
]

cancel_commands = [
    'отмена',
    'cancel'
]

INSTITUTES_PARAMETERS = [
    '?ii=1',
    '?ii=2',
    '?ii=3',
]

SCHEDULE_URL = 'http://rasp.sgugit.ru/'

SCHEDULE_NUMBERS = ['1️⃣', '2️⃣', '3️⃣', '4️⃣', '5️⃣', '6️⃣', '7️⃣', '8️⃣', '9️9️⃣', '🔟']

KEYBOARD_BUTTON_CHOOSE_GROUP = 'Выбрать группу'

MESSAGE_COPYRIGHT = '❗ Расписание взято с сайта СГУГиТ —'
MESSAGE_STOP_FLOOD = '📛 Пожалуйста, прекратите флудить.'
MESSAGE_SCHEDULE_NOT_FOUND = '📛 Расписание не найдено, попробуйте позже.'
MESSAGE_CURRENT_WEEK_NOT_FOUND = '📛 Расписание на текущую неделю не найдено, попробуйте позже.'
MESSAGE_CONNECTION_PROBLEM = '📛 Проблема с соединением сайта, попробуйте позже.'
MESSAGE_SOMETHING_WENT_WRONG = '📛 Что-то пошло не так, попробуйте позже.'

MESSAGE_ON_START = '👋 Здравствуйте. Напишите название вашей группы или выберите вручную.'

MESSAGE_SELECT_INSTITUTE = '🏛 Выберите ваш институт.'
MESSAGE_SELECT_COURSE = '🔢 Выберите ваш курс.'
MESSAGE_SELECT_FORM_OF_TRAINING = '🎫 Выберите форму обучения.'
MESSAGE_SELECT_GROUP = '🎓 Выберите вашу группу.'

MESSAGE_INSTITUTE_NOT_FOUND = '📛 Институт не найден.'
MESSAGE_COURSE_NOT_FOUND = '📛 Курс не найден.'
MESSAGE_FORM_OF_TRAINING_NOT_FOUND = '📛 Форма обучения не найдена.'
MESSAGE_GROUP_NOT_FOUND = '📛 Группа не найдена.'

MESSAGE_CANCELLED = '❌ Действие отменено.'
